#getantidote/use-omz        # handle OMZ dependencies
#ohmyzsh/ohmyzsh path:lib   # load OMZ's library


zsh-users/zsh-completions kind:fpath path:src
belak/zsh-utils path:completion
belak/zsh-utils path:history

zsh-users/zsh-syntax-highlighting
jnooree/zoxide-zsh-completion

ohmyzsh/ohmyzsh path:lib   # load old OMZ library, need get_current_branch


#ohmyzsh/ohmyzsh path:plugins/urltools
ohmyzsh/ohmyzsh path:plugins/aliases
#ohmyzsh/ohmyzsh path:plugins/asdf
#ohmyzsh/ohmyzsh path:plugins/aws
apachler/zsh-aws

#ohmyzsh/ohmyzsh path:plugins/azure
dmakeienko/azcli

#ohmyzsh/ohmyzsh path:plugins/brew
#sticklerm3/alehouse

ohmyzsh/ohmyzsh path:plugins/colored-man-pages
ohmyzsh/ohmyzsh path:plugins/common-aliases
#ohmyzsh/ohmyzsh path:plugins/copyfile
#ohmyzsh/ohmyzsh path:plugins/copypath
#ohmyzsh/ohmyzsh path:plugins/dircycle
#ohmyzsh/ohmyzsh path:plugins/dotnet
ohmyzsh/ohmyzsh path:plugins/encode64

ohmyzsh/ohmyzsh path:plugins/docker
ohmyzsh/ohmyzsh path:plugins/helm
ohmyzsh/ohmyzsh path:plugins/uv


#ohmyzsh/ohmyzsh path:plugins/git
mdumitru/git-aliases

#ohmyzsh/ohmyzsh path:plugins/git-lfs
ohmyzsh/ohmyzsh path:plugins/gitignore
ohmyzsh/ohmyzsh path:plugins/gpg-agent
#ohmyzsh/ohmyzsh path:plugins/history
#ohmyzsh/ohmyzsh path:plugins/history-substring-search
ohmyzsh/ohmyzsh path:plugins/istioctl
ohmyzsh/ohmyzsh path:plugins/jump
ohmyzsh/ohmyzsh path:plugins/kops
#ohmyzsh/ohmyzsh path:plugins/kube-ps1

#ohmyzsh/ohmyzsh path:plugins/kubectl
Dbz/kube-aliases

#ohmyzsh/ohmyzsh path:plugins/kubectx
#ohmyzsh/ohmyzsh path:plugins/macos
ohmyzsh/ohmyzsh path:plugins/opentofu
ohmyzsh/ohmyzsh path:plugins/otp
#ohmyzsh/ohmyzsh path:plugins/screen
ohmyzsh/ohmyzsh path:plugins/terraform
ohmyzsh/ohmyzsh path:plugins/universalarchive
ohmyzsh/ohmyzsh path:plugins/vscode

# load Jim's custom plugins
jimweller/dotfiles path:dotfiles/zsh-jim # load Jim's personal tools
jimweller/dotfiles path:dotfiles/zsh-jim/terragrunt
# jimweller/dotfiles path:dotfiles/oh-my-zsh/docker
# jimweller/dotfiles path:dotfiles/oh-my-zsh/helm
# jimweller/dotfiles path:dotfiles/oh-my-zsh/uv

romkatv/powerlevel10k
