# make completions easier
mattmc3/ez-compinit

# add completions for some commands that don't have them
zsh-users/zsh-completions kind:fpath path:src

# load old OMZ library, need get_current_branch() for git aliases
ohmyzsh/ohmyzsh path:lib   


# gives als to manage aliases
ohmyzsh/ohmyzsh path:plugins/aliases

# handing aws aliases, don't use much. granted.dev is my goto
apachler/zsh-aws

# azure aliases
dmakeienko/azcli

# pretty man
ohmyzsh/ohmyzsh path:plugins/colored-man-pages

# handy posix aliases, ll, la. Especially the suffix commands like L for | less
ohmyzsh/ohmyzsh path:plugins/common-aliases

# docker short aliases, dps, dils, etc.
ohmyzsh/ohmyzsh path:plugins/docker

# helm aliases. hin, hun, etc.
ohmyzsh/ohmyzsh path:plugins/helm

# uv aliaes. uvv, uva, etc.
ohmyzsh/ohmyzsh path:plugins/uv

# tons of git aliases, gc, gcmsg, gcl, ggpush, etc.
# helps me document arcane git sequencies with "als get"
mdumitru/git-aliases

# generate gitignore files with "gi macos,windows,linux,terraform"
ohmyzsh/ohmyzsh path:plugins/gitignore

# starts gpg agent and ssh support
ohmyzsh/ohmyzsh path:plugins/gpg-agent

# manage istio service mesh
ohmyzsh/ohmyzsh path:plugins/istioctl

# kops aliases
ohmyzsh/ohmyzsh path:plugins/kops

# Load Jim's custom PATH setup FIRST (includes asdf shims)
jimweller/dotfiles path:dotfiles/zsh-jim # load Jim's personal tools

# kubektl shorthands. k, kgp, etc. (AFTER PATH is set)
Dbz/kube-aliases

# tt/tf aliass. tta, ttaa, ttd!, etc.
ohmyzsh/ohmyzsh path:plugins/opentofu
ohmyzsh/ohmyzsh path:plugins/terraform

# convert TOTP to one time codes, otp()
ohmyzsh/ohmyzsh path:plugins/otp

#  simple archiving. ua <format> file
ohmyzsh/ohmyzsh path:plugins/universalarchive

# vscode aliases. vsc, vscn, etc.
ohmyzsh/ohmyzsh path:plugins/vscode

# enables zsh history
belak/zsh-utils path:history

# syntax highlighting on the command line
zsh-users/zsh-syntax-highlighting

# completions for zoxide, TODO, doesn't seem to work
jnooree/zoxide-zsh-completion

# ls aliases for eza (better ls)
birdhackor/zsh-eza-ls-plugin

# searches history for matches base on what is typed on the command line
zsh-users/zsh-history-substring-search

# TODO
ptavares/zsh-direnv

# alias rm to move to trash instead of remove from disk
mattmc3/zsh-safe-rm

# terragrunts like terraform/tofu. tg, tgaa, tgd!, etc. Pending PR to OMZ
jimweller/dotfiles path:dotfiles/zsh-jim/terragrunt

# tmux aliases and wrapper
jimweller/dotfiles path:dotfiles/zsh-jim/tmux


# brew aliases, only load on macos
jimweller/dotfiles path:dotfiles/zsh-jim/alehouse conditional:is_macos




# powerlevel 10k is my preferred theme. see p10k.zsh
romkatv/powerlevel10k


