alt-tab
bartender
basictex
codeql
displaylink
dotnet-sdk10
dotnet-sdk10-0-200
dotnet-sdk8
dotnet-sdk8-0-400
drawio
foxitreader
ghostty
gimp
google-drive
iterm2
keybase
lens
lm-studio
macpass
mitmproxy
obs
obsidian
openshot-video-editor
pgadmin4
postman
postman-cli
raycast
shottr
slack
spokenly
tigervnc
tigervnc-viewer
ubar
utm
visual-studio-code
windows-app
