alt-tab
bartender
chatgpt
claude-code
codeql
displaylink
dotnet-sdk8
dotnet-sdk8-0-400
dotnet-sdk9
dotnet-sdk9-0-200
dotnet-sdk9-0-300
drawio
flameshot
foxitreader
gimp
git-credential-manager
google-drive
hazeover
insomnia
iterm2
keka
lens
lm-studio
macpass
microsoft-remote-desktop
obs
obsidian
omnissa-horizon-client
openshot-video-editor
pgadmin4
postman
postman-cli
powershell
raycast
rectangle-pro
session-manager-plugin
shottr
slack
tigervnc-viewer
ubar
utc-menu-clock
visual-studio-code
warp
